## Exercises I

In [1]:
import pandas as pd
import numpy as np
import env

Use your function to obtain a connection to the employees database.

In [ ]:
pd.read_sql('SELECT * FROM employees LIMIT 5', env.get_db_url('employees'))

a. Intentionally make a typo in the database url. What kind of error message do you see?

In [ ]:
# There is an access denied message becasue of the mispelled db name
pd.read_sql('SELECT * FROM employees LIMIT 5', env.get_db_url('employes'))

b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
# it says I have an error in my sql syntax
pd.read_sql('SELECT * FROM employees LMIT 5', env.get_db_url('employees'))

Read the employees and titles tables into two separate DataFrames.

In [ ]:
emp_df = pd.read_sql('SELECT * FROM employees', env.get_db_url('employees'))

In [ ]:
titles_df = pd.read_sql('SELECT * FROM titles', env.get_db_url('employees'))

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [ ]:
emp_df.shape

In [ ]:
titles_df.shape

Display the summary statistics for each DataFrame.

In [ ]:
emp_df.describe(), emp_df.info()

In [ ]:
titles_df.info(), titles_df.describe()

How many unique titles are in the titles DataFrame?

In [ ]:
len(titles_df.title.unique())

In [ ]:
len(titles_df.title.value_counts())

What is the oldest date in the to_date column?

In [ ]:
titles_df.to_date.min()

What is the most recent date in the to_date column?

In [ ]:
# including currrently employed
titles_df.to_date.max()

In [ ]:
# excluding currently employed people
titles_df.to_date[titles_df.to_date != titles_df.to_date.max()].max()

## Exercises II

Copy the users and roles DataFrames from the examples above.

In [ ]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

What is the result of using a right join on the DataFrames?

In [ ]:
#roles = roles.rename(columns={'id':'role_id', 'name':'role'})
pd.merge(users, roles, how='right', on='role_id')

What is the result of using an outer join on the DataFrames?

In [ ]:
pd.merge(users, roles, how='outer', on='role_id')

What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
# if you drop the foreign keys there is no way to correctly merge to roles with the users. If you try to merge with the users 'id' there is no relationship between the users 'id' and the roles 'id'

Load the mpg dataset from PyDataset.

In [ ]:
from pydataset import data
mpg = data('mpg')

Output and read the documentation for the mpg dataset.

In [ ]:
data('mpg', show_doc=True)

How many rows and columns are in the dataset?

In [ ]:
mpg.shape

Check out your column names and perform any cleanup you may want on them.

In [ ]:
## change drv to drive
## change displ to displacement
# mpg = mpg.rename(columns={'drv':'drive', 'displ':'displacement', 'cyl':'cylinders'})

Display the summary statistics for the dataset.

In [ ]:
mpg.describe()

How many different manufacturers are there?

In [ ]:
mpg.manufacturer.nunique()

How many different models are there?

In [ ]:
mpg.model.nunique()

Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [ ]:
#mpg['mileage_diff'] = mpg.hwy - mpg.cty
mpg

Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [ ]:
# mpg['avg_mileage'] = mpg[['cty', 'hwy']].agg('mean', axis=1)
mpg

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [ ]:
mpg['is_automatic'] = mpg.trans.apply(lambda x:'auto' in x)
# mpg[['trans', 'is_automatic']]
# mpg.trans.str.contains('auto')
mpg.trans.str.startswith('auto')

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [ ]:
mpg['avg_mileage'].groupby(mpg.manufacturer).agg('mean').nlargest(1)
mpg.groupby(mpg.manufacturer).avg_mileage.mean()
mpg.avg_mileage.groupby(mpg.manufacturer).mean().nlargest(1)

Do automatic or manual cars have better miles per gallon?

In [ ]:
mpg['avg_mileage'].groupby(mpg.is_automatic).agg('mean')
mpg.groupby('is_automatic').avg_mileage.mean()

## Exercises III

Use your get_db_url function to help you explore the data from the chipotle database.

In [40]:
df = pd.read_sql('SELECT * FROM orders', env.get_db_url('chipotle'))

What is the total price for each order?

In [42]:
df.item_price = df.item_price.apply(lambda x: float(x.replace('$', '')))
df.quantity = df.quantity.apply(float)

df['item_order_price'] = df.quantity * df.item_price

df[['order_id', 'item_price']].groupby('order_id').sum()

          item_price
order_id
1              11.56
2              16.98
3              12.67
4              21.00
5              13.70
...              ...
1830           23.00
1831           12.90
1832           13.20
1833           23.50
1834           28.75

[1834 rows x 1 columns]

What are the most popular 3 items?

In [52]:
df.item_name.value_counts().head(3)

df[['item_name', 'quantity']].groupby('item_name').sum().sort_values('quantity', ascending=False)

                                       quantity
item_name
Chicken Bowl                              761.0
Chicken Burrito                           591.0
Chips and Guacamole                       506.0
Steak Burrito                             386.0
Canned Soft Drink                         351.0
Chips                                     230.0
Steak Bowl                                221.0
Bottled Water                             211.0
Chips and Fresh Tomato Salsa              130.0
Canned Soda                               126.0
Chicken Salad Bowl                        123.0
Chicken Soft Tacos                        120.0
Side of Chips                             110.0
Veggie Burrito                             97.0
Barbacoa Burrito                           91.0
Veggie Bowl                                87.0
Carnitas Bowl                              71.0
Barbacoa Bowl                              66.0
Carnitas Burrito                           60.0
Steak Soft Tacos                           56.0
6 Pack Soft Drink                          55.0
Chips and Tomatillo Red Chili Salsa        50.0
Chicken Crispy Tacos                       50.0
Chips and Tomatillo Green Chili Salsa      45.0
Carnitas Soft Tacos                        40.0
Steak Crispy Tacos                         36.0
Chips and Tomatillo-Green Chili Salsa      33.0
Steak Salad Bowl                           31.0
Nantucket Nectar                           29.0
Chips and Tomatillo-Red Chili Salsa        25.0
Barbacoa Soft Tacos                        25.0
Chips and Roasted Chili Corn Salsa         23.0
Izze                                       20.0
Veggie Salad Bowl                          18.0
Chips and Roasted Chili-Corn Salsa         18.0
Barbacoa Crispy Tacos                      12.0
Barbacoa Salad Bowl                        10.0
Chicken Salad                               9.0
Carnitas Crispy Tacos                       8.0
Veggie Soft Tacos                           8.0
Burrito                                     6.0
Veggie Salad                                6.0
Carnitas Salad Bowl                         6.0
Bowl                                        4.0
Steak Salad                                 4.0
Salad                                       2.0
Crispy Tacos                                2.0
Chips and Mild Fresh Tomato Salsa           1.0
Carnitas Salad                              1.0
Veggie Crispy Tacos                         1.0

Which item has produced the most revenue?

In [61]:
# item count * the item price
df[['item_name', 'item_price']].groupby('item_name').sum().sort_values('item_price', ascending=False)

pd.pivot_table(data=df, index='item_name', values='item_price', aggfunc='sum').sort_values('item_price', ascending=False)

                                       item_price
item_name
Chicken Bowl                              7342.73
Chicken Burrito                           5575.82
Steak Burrito                             3851.43
Steak Bowl                                2260.19
Chips and Guacamole                       2201.04
Chicken Salad Bowl                        1228.75
Chicken Soft Tacos                        1108.09
Veggie Burrito                             934.77
Barbacoa Burrito                           894.75
Veggie Bowl                                867.99
Carnitas Bowl                              736.71
Barbacoa Bowl                              672.36
Carnitas Burrito                           597.83
Steak Soft Tacos                           536.05
Chips                                      494.34
Chicken Crispy Tacos                       472.13
Canned Soft Drink                          438.75
Carnitas Soft Tacos                        375.94
Chips and Fresh Tomato Salsa               361.36
Steak Crispy Tacos                         357.34
6 Pack Soft Drink                          356.95
Steak Salad Bowl                           343.59
Bottled Water                              302.56
Barbacoa Soft Tacos                        250.46
Side of Chips                              185.90
Veggie Salad Bowl                          182.50
Chips and Tomatillo Red Chili Salsa        147.50
Canned Soda                                137.34
Chips and Tomatillo Green Chili Salsa      132.75
Barbacoa Crispy Tacos                      120.21
Barbacoa Salad Bowl                        106.40
Nantucket Nectar                            98.31
Chicken Salad                               81.09
Chips and Tomatillo-Green Chili Salsa       78.87
Carnitas Crispy Tacos                       77.96
Veggie Soft Tacos                           73.96
Chips and Roasted Chili Corn Salsa          67.85
Izze                                        67.80
Carnitas Salad Bowl                         66.34
Chips and Tomatillo-Red Chili Salsa         59.75
Veggie Salad                                50.94
Burrito                                     44.40
Chips and Roasted Chili-Corn Salsa          43.02
Steak Salad                                 35.66
Bowl                                        29.60
Salad                                       14.80
Crispy Tacos                                14.80
Carnitas Salad                               8.99
Veggie Crispy Tacos                          8.49
Chips and Mild Fresh Tomato Salsa            3.00

Join the employees and titles DataFrames together.

In [62]:
df = pd.read_sql('SELECT * FROM employees JOIN titles USING (emp_no)', env.get_db_url('employees'))

For each title, find the hire date of the employee that was hired most recently with that title.

In [63]:
df.pivot_table(index='title', values='hire_date', aggfunc='max')

                     hire_date
title
Assistant Engineer  1999-12-24
Engineer            2000-01-28
Manager             1992-02-05
Senior Engineer     2000-01-01
Senior Staff        2000-01-13
Staff               2000-01-12
Technique Leader    1999-12-31

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [16]:
df = pd.read_sql('''SELECT *
FROM titles
	JOIN dept_emp USING (emp_no)
	JOIN departments USING (dept_no);''', env.get_db_url('employees'))

In [18]:
pd.crosstab(df.dept_name, df.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0